Revit 2027 API
MEPCurveType.Shape Property
 The shape of the profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectorProfileType Shape { get; }
Public ReadOnly Property Shape As ConnectorProfileType
	Get
public:
property ConnectorProfileType Shape {
	ConnectorProfileType get ();
}
member Shape : ConnectorProfileType with get
Property Value
ConnectorProfileType
See Also
Reference
MEPCurveType Class
Autodesk.Revit.DB Namespace